{
    "LANGUAGE_SELECT": "English",
    "LOCALIZATION_HEADER": "Example for translation in baboon!",
    "LOCALIZATION_INTRO": "In baboon we use the module angular-translate for the tranaltion. We will show you some examples. A detailed documentation can be found here:",
    "LOCALIZATION_LINK": "Angular-Translate documentation",
    "Q1": "How to configure the translation?",
    "Q1_TEXT": "The translation is configured in the config area of the angular app. We use static files. They are located in the folder public/locale. The files are stored with a name-schema locale-langKey.json. For example, locale-de.json === german locale file, locale-en.json === english locale file. Angular-translate loads the language files from the server on demand. The default and fallback language is english.",
    "Q2": "How can the user change his language?",
    "Q2_TEXT": "The user can change the language at runtime (see buttons above). Then the language is stored in the session.",
    "Q3": "How to store the users language?",
    "Q3_TEXT": "In the baboon admin area you can store the default language of the user. When the app starts, this default language is saved in the session on the server. The client app then loads the language from the session.",
    "Q4": "How to configure the date, number and currency formatting?",
    "Q4_TEXT": "For the date, number and currency formatting we use the internationalization and localization feature of angularjs in conjunction with the module angular-dynamic-locale. Required modules:",
    "Q4_TEXT2": "In the config area of the angular app the search pattern of localization files is set. The part '{{locale}}' is a placeholder for the current selected language.",
    "Q4_TEXT3": "In the run area of the angular app we respond to the $translateChangeSuccess event which is triggered by angular-translate after the language is changed successfully. We passed angular-dynamic-locale the current language and this will, if necessary, dynamically loaded from the server.",
    "LOCALIZATION_GERMANY": "Germany",
    "NUMBER_FORMAT": "Number format",
    "CURRENCY_FORMAT": "Currency format",
    "DATE_FORMAT": "Date format"
}